app/Admin/Controllers/ShopCategoryController.php

    public function postEdit($id)
    {
        $data = request()->all();
        $dataOrigin = request()->all();
        $validator = Validator::make($dataOrigin, [
            'image' => 'required',
            'sort' => 'numeric|min:0',
            'descriptions.*.name' => 'required|string|max:100',
        ], [
            'descriptions.*.name.required' => trans('validation.required', ['attribute' => trans('category.name')]),
        ]);

        if ($validator->fails()) {
            return redirect()->back()
                ->withErrors($validator)
                ->withInput();
        }
//Edit

        $dataUpdate = [
            'image' => $data['image'],
            'parent' => $data['parent'],
            'sort' => $data['sort'],
            'top' => empty($data['top']) ? 0 : 1,
            'status' => empty($data['status']) ? 0 : 1,
        ];

        $obj = ShopCategory::find($id);
        $obj->update($dataUpdate);
---
update `shop_category` set `top` = 0 where `id` = 14