app/Admin/Controllers/ShopPageController.php

        ];
        $obj = new ShopPage;

        $obj = $obj
            ->leftJoin('shop_page_description', 'shop_page_description.page_id', 'shop_page.id')
            ->where('shop_page_description.lang', $this->lang);
---
select * from `shop_page` left join `shop_page_description` on `shop_page_description`.`page_id` = `shop_page`.`id` where `shop_page_description`.`lang` = 'en' order by `id` desc limit 20 offset 0
select count(*) as aggregate from `shop_page` left join `shop_page_description` on `shop_page_description`.`page_id` = `shop_page`.`id` where `shop_page_description`.`lang` = 'en'