app/Admin/Controllers/ShopOrderController.php

        } else {
            $obj = $obj->orderBy('id', 'desc');
        }
        $dataTmp = $obj->paginate(20);
---
select * from `shop_order` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `shop_order`

                (new ShopOrder)->addOrderHistory($dataHistory);

                //Update total price
                $subtotal = ShopOrderDetail::select(DB::raw('sum(total_price) as subtotal'))
                    ->where('order_id', $order_id)
                    ->first()->subtotal;
---
select sum(total_price) as subtotal from `shop_order_detail` where `order_id` = '1' limit 1

    public function postEditItem()
    {
        try {
            $id = request('pk');
            $field = request('name');
            $value = request('value');
            $item = ShopOrderDetail::find($id);
            $fieldOrg = $item->{$field};
            $orderID = $item->order_id;
            $item->{$field} = $value;
            $item->total_price = $value * (($field == 'qty') ? $item->price : $item->qty);
            $item->save();
---
select * from `shop_order_detail` where `id` = 1 limit 1
update `shop_order_detail` set `qty` = '2', `total_price` = 10000, `shop_order_detail`.`updated_at` = '2019-11-14 03:23:28' where `id` = 1

            }

            //Update total price
            $subtotal = ShopOrderDetail::select(DB::raw('sum(total_price) as subtotal'))
                ->where('order_id', $orderID)
                ->first()->subtotal;
---
select sum(total_price) as subtotal from `shop_order_detail` where `order_id` = 1 limit 1