app/Admin/Controllers/ShopProductController.php

            'sort' => (int) $data['sort'],
        ];

        $product->update($dataUpdate);
---
update `shop_product` set `type` = '2', `shop_product`.`updated_at` = '2019-11-14 02:40:24' where `id` = 17

                    }

                }
                $product->attributes()->saveMany($arrDataAtt);
---
insert into `shop_product_attribute` (`name`, `attribute_group_id`, `product_id`) values ('Blue', 1, 17)

                    $arrSubImages[] = new ShopProductImage(['image' => $image]);
                }
            }
            $product->images()->saveMany($arrSubImages);
---
insert into `shop_product_image` (`image`, `product_id`) values ('/data/product/img-12.jpg', 17)