app/Admin/Controllers/ShopTemplateController.php

update `admin_store` set `template` = 'tz-template' where `id` = 1
---
    public function changeTemplate()
    {
        $key = request('key');
        $process = AdminStore::first()->update(['template' => $key]);