app/Models/ShopCurrency.php

select * from `shop_currency` where `code` = 'USD' limit 1
---
    public static function setCode($code)
    {
        self::$code = $code;
        if (empty(self::$checkListCurrency[$code])) {
            self::$checkListCurrency[$code] = self::where('code', $code)->first();

select * from `shop_currency` where `code` = 'USD' limit 1
---
    public static function onlyRender(float $money, $currency, $space_between_symbol = false, $include_symbol = true)
    {
        if (empty(self::$checkListCurrency[$currency])) {
            self::$checkListCurrency[$currency] = self::where('code', $currency)->first();

select * from `shop_currency` where `status` = 1 order by `sort` asc, `id` desc
---
    public static function getAll()
    {
        return self::where('status', 1)->sort()->get();