app/Modules/Block/Controllers/LastViewProduct.php

    public function render()
    {
        if (!empty(sc_config($this->configKey))) {
            $arrProductsLastView = array();
            $lastView = empty(\Cookie::get('productsLastView')) ? [] : json_decode(\Cookie::get('productsLastView'), true);
            if ($lastView) {
                arsort($lastView);
            }

            if (count($lastView)) {
                $lastView = array_slice($lastView, 0, 5, true);
                $productsLastView = ShopProduct::whereIn('id', array_keys($lastView))->get();
---
select * from `shop_product` where `id` in (12, 17)